* xg480_phy 25g/10g verification todo [95%]
** DONE The rate_meter_multiple issues [66%]
   CLOSED: [2018-07-11 Wed 16:50]
   - State "DONE"       from "STARTED"    [2018-07-11 Wed 16:50]
*** TODO tc_204 Line side rate_meter_rx trigger mac_tx send out the pause; the interval isn't correct.
    - State "TODO"       from "DONE"       [2018-08-22 Wed 10:32]
    - State "DONE"       from "TODO"       [2018-07-09 Mon 17:06]
    - State "TODO"       from "WAITING"    [2018-05-30 Wed 11:25]
     input traffic 25G, rate meter set to 1G, but pause frame PB upstream with 1.118G
**** DONE tc_204 rate_meter_rx trigger mac_tx gen pause has bug, the interval of ON type pause is so closed. it's 200us, the expect value is 2ms.
     CLOSED: [2018-07-12 Thu 14:51]
     - State "DONE"       from "STARTED"    [2018-07-12 Thu 14:51]
     :LOGBOOK:  
     CLOCK: [2018-07-12 Thu 11:10]--[2018-07-12 Thu 14:51] =>  3:41
     :END:      
     Tonny remove the progma translate_off/on for the fast simulation.
*** DONE tc_209 Line side mac_tx port shaper function (by rate_meter_multiple module) test.[100%]
    CLOSED: [2018-08-22 Wed 09:16]
    - State "DONE"       from "TODO"       [2018-08-22 Wed 09:16]
    - State "TODO"       from "DONE"       [2018-07-19 Thu 14:58]
    - State "DONE"       from "STARTED"    [2018-07-16 Mon 16:43]
    - State "STARTED"    from "DONE"       [2018-07-12 Thu 14:57]
    - State "DONE"       from "STARTED"    [2018-07-09 Mon 18:08]
   :LOGBOOK:  
   CLOCK: [2018-07-09 Mon 17:07]--[2018-07-09 Mon 17:45] =>  0:38
   CLOCK: [2018-07-09 Mon 15:51]--[2018-07-09 Mon 16:11] =>  0:20
   :END:      
    double check the output rate for fixed size packet. it should almost equal the setting rate.
    <2018-08-22 Wed 09:13> After correcting the CLOCK1X_FREQUENCY to 177_777_778, the rate of output traffic is equal the prov value. so it pass.
**** DONE SYS side DRIVER/MONITOR don't respond BP, DUT segbuf will overflow, DUT should not send out the fragment of packet.
     CLOSED: [2018-07-09 Mon 17:45]
     - State "DONE"       from "STARTED"    [2018-07-09 Mon 17:45]
    :LOGBOOK:  
    CLOCK: [2018-07-09 Mon 16:32]--[2018-07-09 Mon 16:43] =>  0:11
    :END:      
    tc_209
***** DONE tc_209 port shaper didn't gen rate Exceed out, egress input traffic 25G, port shaper set 10G. need Tonny double check.
      CLOSED: [2018-07-16 Mon 16:50]
      - State "DONE"       from "TODO"       [2018-07-16 Mon 16:50]
        <2018-07-16 Mon 16:50> rate_meter multiple can send out the BP to arbiter, but arbiter didn't response it. after Haidong checking, modifiy the cfg_pkg.sv, the issue has gone. the issue is due to the priority of arbiter scheduling.
**** CANCELLED make SYS side DRIVER/MONITOR respond BP, if shaper set 15G, input 25G, if driver receive the BP, driver will adapt the 15G 
     CLOSED: [2018-07-16 Mon 16:43]
*** DONE tc_301a tc_301b arbition with rate meter multiple, 25G device, 10G mode, sys side use rate meter multiple shaper to 10G.
    CLOSED: [2018-07-09 Mon 16:59] 
    - State "DONE"       from "TODO"       [2018-07-09 Mon 16:59]
    25G device work as 10G mode. Becasue system side always work as 25G mode, so sys side need rate_meter to limit the output traffic.
    for 10G mode terminal looback, if line side input traffic + terminal loop traffic > 10G, rate_meter_multiple will BP terminal loop traffic.
** DONE Port based lookback testcase updating [100%]
   CLOSED: [2018-06-06 Wed 14:52]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:52]
   :LOGBOOK:  
   CLOCK: [2018-06-06 Wed 14:26]--[2018-06-06 Wed 14:52] =>  0:26
   :END:      
*** DONE tc_300
    CLOSED: [2018-06-06 Wed 14:08]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:08]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 12:17]--[2018-06-06 Wed 12:22] =>  0:05
    :END:      
*** DONE tc_300_lab
    CLOSED: [2018-06-06 Wed 14:10]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:10]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 14:08]--[2018-06-06 Wed 14:10] =>  0:02
    :END:      
*** DONE tc_301
    CLOSED: [2018-06-06 Wed 14:24]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:24]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 14:10]--[2018-06-06 Wed 14:24] =>  0:14
    :END:      
** DONE vlan_det_lookup device level test. [100%]
   CLOSED: [2018-06-06 Wed 17:42]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 17:42]
   - State "STARTED"    from "DONE"       [2018-06-06 Wed 12:12]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:57]
   :LOGBOOK:  
   CLOCK: [2018-06-06 Wed 17:38]--[2018-06-06 Wed 17:42] =>  0:04
   CLOCK: [2018-05-30 Wed 12:20]--[2018-05-30 Wed 12:21] =>  0:01
   CLOCK: [2018-05-30 Wed 12:13]--[2018-05-30 Wed 12:14] =>  0:01
   CLOCK: [2018-05-30 Wed 11:51]--[2018-05-30 Wed 11:59] =>  0:08
   CLOCK: [2018-05-30 Wed 11:32]--[2018-05-30 Wed 11:49] =>  0:17
   :END:      
*** DONE tb_env support
    CLOSED: [2018-05-30 Wed 16:13]
    - State "DONE"       from "DONE"       [2018-08-17 Fri 17:26]
    - State "DONE"       from "TODO"       [2018-05-30 Wed 16:13]
*** DONE transfer function support: lpbk_y1564_det transfer funciton instance the vlan_det_lookup TF.
    CLOSED: [2018-05-30 Wed 16:13]
    - State "DONE"       from "TODO"       [2018-05-30 Wed 16:13]
*** DONE testcase setup [100%]
    CLOSED: [2018-06-06 Wed 12:11]
    - State "DONE"       from "TODO"       [2018-06-06 Wed 12:11]
    - State "TODO"       from "DONE"       [2018-06-06 Wed 12:11]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
**** DONE tc_302 vlan based fac loobpack [100%]
     CLOSED: [2018-06-06 Wed 11:56]
     - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
     - State "STARTED"    from "DONE"       [2018-05-31 Thu 17:21]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:23]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 17:21]--[2018-05-31 Thu 17:22] =>  0:01
     CLOCK: [2018-05-31 Thu 16:01]--[2018-05-31 Thu 16:09] =>  0:08
     CLOCK: [2018-05-31 Thu 15:54]--[2018-05-31 Thu 15:57] =>  0:03
     CLOCK: [2018-05-31 Thu 15:38]--[2018-05-31 Thu 15:43] =>  0:05
     CLOCK: [2018-05-31 Thu 14:50]--[2018-05-31 Thu 15:20] =>  0:30
     CLOCK: [2018-05-31 Thu 09:45]--[2018-05-31 Thu 09:46] =>  0:01
     CLOCK: [2018-05-30 Wed 17:32]--[2018-05-30 Wed 17:38] =>  0:06
     CLOCK: [2018-05-30 Wed 17:08]--[2018-05-30 Wed 17:16] =>  0:08
     CLOCK: [2018-05-30 Wed 16:23]--[2018-05-30 Wed 16:27] =>  0:04
     :END:      
***** DONE flow based fac loopback by vlan_det_lookup; disable port based loop, provisioning only 1 matchId(63)
      CLOSED: [2018-05-31 Thu 17:22]
      - State "DONE"       from "TODO"       [2018-05-31 Thu 17:22]
       change the mac_rx_4.sv to every segment send request to vlan_det module; there are 2 flows did not loopback, need Jimmy to double check DUT.<2018-05-30 Wed 17:42> 
       the vlan_det_lookup moudle has bug. Bob is working on it. <2018-05-31 Thu 09:45> 
       Add 2 parameter to LINE 257 in main_clock.sv, they are REF_JITTER1(0.0) REF_JITTER2(0.0), Re-run tc_302, then check the result again. Bob found the issue is caused by the clock's phase. <2018-05-31 Thu 15:10>; copy the wave to vsim_jitter_set_0.wlf, result is pass !?
       Haidong advice that changing the CLKFBOUT_MULT_F form 63.000 to 64.000, re-run again.<2018-05-31 Thu 15:42>; copy the wave to vsim_just_clkfb_set_64.wlf, result is pass!?
       Return the all modification of main_clock, is re-running.<2018-05-31 Thu 15:57> the result is pass, cannot re-produce th issus?!
***** DONE more traffic input to lookup based on matchId 63. 
      CLOSED: [2018-06-01 Fri 09:26]
      - State "DONE"       from "STARTED"    [2018-06-01 Fri 09:26]
      - State "STARTED"    from "DONE"       [2018-06-01 Fri 09:25]
      - State "DONE"       from "STARTED"    [2018-05-31 Thu 18:11]
      :LOGBOOK:  
      CLOCK: [2018-06-01 Fri 09:25]--[2018-06-01 Fri 09:26] =>  0:01
      CLOCK: [2018-05-31 Thu 18:00]--[2018-05-31 Thu 18:11] =>  0:11
      CLOCK: [2018-05-31 Thu 17:43]--[2018-05-31 Thu 17:48] =>  0:05
      CLOCK: [2018-05-31 Thu 17:23]--[2018-05-31 Thu 17:41] =>  0:18
      :END:      
      phy1 input 51 flows, flow11--flow20 are untagged l2cp frame, they are exception. others will do flow based loopback.
***** DONE more matchId provisioning.
      CLOSED: [2018-06-06 Wed 11:56]
      - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
      :LOGBOOK:  
      CLOCK: [2018-06-06 Wed 11:49]--[2018-06-06 Wed 11:56] =>  0:07
      CLOCK: [2018-06-06 Wed 11:19]--[2018-06-06 Wed 11:37] =>  0:18
      CLOCK: [2018-06-06 Wed 10:06]--[2018-06-06 Wed 10:30] =>  0:24
      CLOCK: [2018-06-06 Wed 09:02]--[2018-06-06 Wed 09:11] =>  0:09
      CLOCK: [2018-06-06 Wed 08:36]--[2018-06-06 Wed 08:53] =>  0:17
      CLOCK: [2018-06-05 Tue 18:32]--[2018-06-05 Tue 19:09] =>  0:37
      CLOCK: [2018-06-05 Tue 17:38]--[2018-06-05 Tue 18:14] =>  0:36
      CLOCK: [2018-06-05 Tue 16:51]--[2018-06-05 Tue 17:28] =>  0:37
      CLOCK: [2018-06-05 Tue 16:28]--[2018-06-05 Tue 16:42] =>  0:14
      CLOCK: [2018-06-05 Tue 15:48]--[2018-06-05 Tue 16:02] =>  0:14
      CLOCK: [2018-06-05 Tue 15:43]--[2018-06-05 Tue 15:45] =>  0:02
      CLOCK: [2018-06-05 Tue 14:30]--[2018-06-05 Tue 14:40] =>  0:10
      CLOCK: [2018-06-05 Tue 12:21]--[2018-06-05 Tue 12:23] =>  0:02
      CLOCK: [2018-06-05 Tue 12:08]--[2018-06-05 Tue 12:16] =>  0:08
      CLOCK: [2018-06-05 Tue 11:56]--[2018-06-05 Tue 12:00] =>  0:04
      CLOCK: [2018-06-05 Tue 11:23]--[2018-06-05 Tue 11:39] =>  0:16
      CLOCK: [2018-06-05 Tue 09:23]--[2018-06-05 Tue 09:32] =>  0:09
      CLOCK: [2018-06-05 Tue 09:00]--[2018-06-05 Tue 09:12] =>  0:12
      CLOCK: [2018-06-01 Fri 18:20]--[2018-06-01 Fri 18:26] =>  0:06
      CLOCK: [2018-06-01 Fri 17:56]--[2018-06-01 Fri 18:01] =>  0:05
      CLOCK: [2018-06-01 Fri 17:12]--[2018-06-01 Fri 17:44] =>  0:32
      CLOCK: [2018-06-01 Fri 16:19]--[2018-06-01 Fri 17:06] =>  0:47
      CLOCK: [2018-06-01 Fri 16:06]--[2018-06-01 Fri 16:11] =>  0:05
      CLOCK: [2018-06-01 Fri 14:22]--[2018-06-01 Fri 14:40] =>  0:18
      CLOCK: [2018-06-01 Fri 11:54]--[2018-06-01 Fri 12:28] =>  0:34
      CLOCK: [2018-06-01 Fri 11:53]--[2018-06-01 Fri 11:54] =>  0:01
      :END:      
      every port have flow based loopback.[[file:xg480_phy_verify_notes.org::tc_302a][tc_302a]]  
      every port have flow based loopback.[[file:xg480_phy_verify_notes.org::tc_302b][tc_302b]]  
***** DONE tc_302b fail, need desinger to debug.
      CLOSED: [2018-07-11 Wed 17:42]
      - State "DONE"       from "STARTED"    [2018-07-11 Wed 17:42]
      :LOGBOOK:  
      CLOCK: [2018-07-11 Wed 16:31]--[2018-07-11 Wed 16:35] =>  0:04
      CLOCK: [2018-07-11 Wed 15:29]--[2018-07-11 Wed 16:21] =>  0:52
      :END:      
**** DONE tc_303 vlan based terminal loopback
     CLOSED: [2018-07-13 Fri 15:31]
     - State "DONE"       from "STARTED"    [2018-07-13 Fri 15:31]
     :LOGBOOK:  
     CLOCK: [2018-07-13 Fri 14:51]--[2018-07-13 Fri 15:31] =>  0:40
     :END:      
*** DONE align the testcase from 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 17:06]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:06]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 16:47]--[2018-05-30 Wed 17:03] =>  0:16
    :END:      
    - [X] tc_302
**** DONE re-run tc_302 on 10g device TB
     CLOSED: [2018-05-31 Thu 16:45]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:45]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 16:36]--[2018-05-31 Thu 16:43] =>  0:07
     CLOCK: [2018-05-31 Thu 16:24]--[2018-05-31 Thu 16:32] =>  0:08
     :END:      
     it's pass. need add more traffic flows, to generate more condiction to run this case
** DONE port_process_ingress/port_process_egress (afp+pcp) test. [100%]
   CLOSED: [2018-09-10 Mon 11:11]
   - State "DONE"       from "TODO"       [2018-09-10 Mon 11:11]
*** DONE port_proc_ingress [100%]
    CLOSED: [2018-09-10 Mon 11:11]
    - State "DONE"       from "STARTED"    [2018-09-10 Mon 11:11]
    :LOGBOOK:  
    CLOCK: [2018-09-04 Tue 14:08]--[2018-09-04 Tue 18:17] =>  4:09
    CLOCK: [2018-09-04 Tue 12:08]--[2018-09-04 Tue 12:26] =>  0:18
    :END:      
**** DONE provisioning method
     CLOSED: [2018-09-06 Thu 11:18]
     - State "DONE"       from "STARTED"    [2018-09-06 Thu 11:18]
     :LOGBOOK:  
     CLOCK: [2018-09-04 Tue 11:48]--[2018-09-04 Tue 12:03] =>  0:15
     :END:      
**** DONE transfer function
     CLOSED: [2018-09-06 Thu 15:23]
     - State "DONE"       from "STARTED"    [2018-09-06 Thu 15:23]
     :LOGBOOK:  
     CLOCK: [2018-09-06 Thu 11:18]--[2018-09-06 Thu 15:09] =>  3:51
     :END:      
**** DONE tc_030 Ingress to test pcpDecoder and push pvid, swap priVid
     CLOSED: [2018-09-07 Fri 16:46]
     - State "DONE"       from "STARTED"    [2018-09-07 Fri 16:46]
     :LOGBOOK:  
     CLOCK: [2018-09-07 Fri 15:43]--[2018-09-07 Fri 16:46] =>  1:03
     CLOCK: [2018-09-07 Fri 14:19]--[2018-09-07 Fri 15:02] =>  0:43
     :END:      
*** DONE port_proc_egress [100%]
    CLOSED: [2018-09-10 Mon 11:11]
    - State "DONE"       from "STARTED"    [2018-09-10 Mon 11:11]
    :LOGBOOK:  
    CLOCK: [2018-09-06 Thu 16:58]--[2018-09-06 Thu 17:59] => 1:01
    :END:      
**** DONE provisioning method
     CLOSED: [2018-09-07 Fri 14:11]
     - State "DONE"       from "TODO"       [2018-09-07 Fri 14:11]
**** DONE transfer function
     CLOSED: [2018-09-07 Fri 14:11]
     - State "DONE"       from "TODO"       [2018-09-07 Fri 14:11]
**** DONE tc_030
     CLOSED: [2018-09-07 Fri 16:46]
     - State "DONE"       from "TODO"       [2018-09-07 Fri 16:46]
*** TODO tc_030a egress with OTMH/ITMH. 25G device
*** TODO tc_030b egress with OTMH/ITMH. 25G device, 100G mode.
*** TODO tc_030a egress with OTMH/ITMH. 10G device
** DONE 100g PTP [100%]
   CLOSED: [2018-06-06 Wed 15:00]
   - State "DONE"       from "TODO"       [2018-06-06 Wed 15:00]
*** DONE testcase setup [100%]
    CLOSED: [2018-06-26 Tue 18:06]
    - State "DONE"       from "STARTED"    [2018-06-26 Tue 18:06]
    - State "STARTED"    from "DONE"       [2018-06-26 Tue 18:01]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 15:00]
    - State "STARTED"    from "DONE"       [2018-06-06 Wed 12:13]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
    :LOGBOOK:  
    CLOCK: [2018-06-26 Tue 18:01]--[2018-06-26 Tue 18:05] =>  0:04
    CLOCK: [2018-06-06 Wed 11:39]--[2018-06-06 Wed 11:49] =>  0:10
    CLOCK: [2018-06-06 Wed 09:59]--[2018-06-06 Wed 10:04] =>  0:05
    CLOCK: [2018-06-06 Wed 09:23]--[2018-06-06 Wed 09:53] =>  0:30
    CLOCK: [2018-06-06 Wed 08:59]--[2018-06-06 Wed 09:02] =>  0:03
    :END:      
    - [X] [[file:xg480_phy_verify_notes.org::tc_507][tc_507]], based tc_007 and tc_500, 100G mode ptp testcase
** DONE 100g CGMII interface [100%]
   CLOSED: [2018-06-15 Fri 18:02]
   - State "DONE"       from "STARTED"    [2018-06-15 Fri 18:02]
   :LOGBOOK:  
   CLOCK: [2018-06-14 Thu 11:10]--[2018-06-14 Thu 14:00] =>  2:50
   :END:      
   integrating the cgmii driver/monitor into TB/TB_ENV
*** DONE CGMII Monitor [100%]
    CLOSED: [2018-06-13 Wed 11:38]
    - State "DONE"       from "STARTED"    [2018-06-13 Wed 11:38]
    :LOGBOOK:  
    CLOCK: [2018-06-05 Tue 16:02]--[2018-06-05 Tue 16:05] =>  0:03
    CLOCK: [2018-06-05 Tue 14:52]--[2018-06-05 Tue 14:53] =>  0:01
    CLOCK: [2018-06-05 Tue 14:40]--[2018-06-05 Tue 14:45] =>  0:05
    CLOCK: [2018-06-05 Tue 12:16]--[2018-06-05 Tue 12:21] =>  0:05
    CLOCK: [2018-06-05 Tue 12:02]--[2018-06-05 Tue 12:08] =>  0:06
    :END:      
    - [X] CGMII RX SPEC and RTL [2/2]
      - [X] SPEC: the SPEC has been ready, Leo committed it.<2018-05-30 Wed> 
      - [X] RTL: it has been ready <2018-05-30 Wed> 
    - [X] UVM monitor 
*** DONE CGMII Driver [100%]
    CLOSED: [2018-06-13 Wed 11:38]
    - State "DONE"       from "STARTED"    [2018-06-13 Wed 11:38]
    :LOGBOOK:  
    CLOCK: [2018-06-13 Wed 10:55]--[2018-06-13 Wed 11:38] =>  0:43
    CLOCK: [2018-06-13 Wed 09:29]--[2018-06-13 Wed 09:47] =>  0:18
    CLOCK: [2018-06-07 Thu 10:22]--[2018-06-07 Thu 11:29] =>  1:07
    CLOCK: [2018-06-07 Thu 09:38]--[2018-06-07 Thu 10:02] =>  0:24
    CLOCK: [2018-06-07 Thu 09:01]--[2018-06-07 Thu 09:26] =>  0:25
    CLOCK: [2018-06-06 Wed 16:44]--[2018-06-06 Wed 16:59] =>  0:15
    CLOCK: [2018-06-06 Wed 15:17]--[2018-06-06 Wed 15:25] =>  0:08
    CLOCK: [2018-06-05 Tue 17:33]--[2018-06-05 Tue 17:38] =>  0:05
    CLOCK: [2018-06-05 Tue 16:42]--[2018-06-05 Tue 16:51] =>  0:09
    CLOCK: [2018-06-05 Tue 16:21]--[2018-06-05 Tue 16:28] =>  0:07
    CLOCK: [2018-06-05 Tue 16:05]--[2018-06-05 Tue 16:15] =>  0:10
    :END:      
    - [X] CGMII TX [2/2]
      - [X] SPEC
      - [X] RTL
    - [X] UVM Driver 
** CANCELLED y1564 feature test.
   CLOSED: [2018-05-31 Thu 18:23]
*** DONE monitor, Lance work on it.
    CLOSED: [2018-06-26 Tue 09:05]
    - State "DONE"       from "TODO"       [2018-06-26 Tue 09:05]
*** DONE generator, Lance work on it.
    CLOSED: [2018-06-26 Tue 09:05]
    - State "DONE"       from "TODO"       [2018-06-26 Tue 09:05]
** DONE Reserved Pin on DUT's top test [83%]
   CLOSED: [2018-07-02 Mon 08:54]
*** DONE update tc_1000 [3/4]
    CLOSED: [2018-06-26 Tue 18:34]
    - State "DONE"       from "STARTED"    [2018-06-26 Tue 18:34]
      set up new test case tc_1001, it bypass transceiver, can fast run simulation
**** DONE sgmii east/west backpressure out/in pin. tc_1001
     CLOSED: [2018-06-26 Tue 17:46]
     - State "DONE"       from "STARTED"    [2018-06-26 Tue 17:46]
     :LOGBOOK:  
     CLOCK: [2018-06-26 Tue 15:47]--[2018-06-26 Tue 17:11] =>  1:24
     :END:      
     sgmiiEastRxBackpressureOut,
     sgmiiEastTxBackpressureIn,
     sgmiiWestRxBackpressureOut,
     sgmiiWestTxBackpressureIn
     In top.sv connect the output to input, then write the internal register with 1/0, read the input indication register.
**** DONE gasicParityInOut, gasicParityErrOut tc_1001
     CLOSED: [2018-06-26 Tue 17:55]
     - State "DONE"       from "STARTED"    [2018-06-26 Tue 17:55]
     :LOGBOOK:  
     CLOCK: [2018-06-26 Tue 17:46]--[2018-06-26 Tue 17:55] =>  0:09
     :END:      
     input         gasicParityInOut  ,
     input  logic  gasicParityErrOut , // change to input for pin test
     Set those two signal 1/0, read the related indication register on device reg.
**** TODO SFP status and control pin, out pin test fail, need Haidong double check. tc_1001
     - State "TODO"       from "DONE"       [2018-06-27 Wed 14:31]
     - State "DONE"       from "DONE"       [2018-06-27 Wed 14:31]
     - State "DONE"       from "STARTED"    [2018-06-26 Tue 18:26]
     :LOGBOOK:  
     CLOCK: [2018-06-26 Tue 18:07]--[2018-06-26 Tue 18:26] =>  0:19
     :END:      
     input    logic [7:0]          sfpPresentIn_n             ,
     input    logic [7:0]          sfpLosIn                   ,
     input    logic [7:0]          sfpTxFaultIn               ,
     output   logic [7:0]          sfpTxDisableOut            ,
     output   logic [7:0]          sfpModuleSelOut            ,
     output   logic [7:0]          sfpLowPowerModeOut         ,
     For input signal, set them to 1/0, read related indication register on device reg.
     For output signal, write the related regiset on device reg, check/monitor the signal on top.sv/TB.
**** DONE cpldInOut tc_1001
     CLOSED: [2018-06-26 Tue 18:34]
     - State "DONE"       from "TODO"       [2018-06-26 Tue 18:34]
     input          [3:0]          cpldInOut                  ,     // Only cpldInOut[1:0] valid in HW connection
     Input signal, set them to 1/0, read related indication register on device reg.
*** DONE update tc_500c [100%]
    CLOSED: [2018-06-27 Wed 14:41]
    - State "DONE"       from "TODO"       [2018-06-27 Wed 14:41]
**** CANCELLED ptpClkCompensate In/out, it has been correct work, if not, the pll cannot lock
     CLOSED: [2018-06-27 Wed 14:31]
     input    logic                ptpClkCompensateIn         ,
     output   logic                ptpClkCompensateOut        ,
     In top.sv, connect the output to input, read the address 0x0c bit8 on ptp_server module. the value is 1, then change to 0.
**** DONE ptpMicroSemiLoadSave, it has been tested in the broad_sync testcase tc_500c
     CLOSED: [2018-06-27 Wed 14:33]
     - State "DONE"       from "TODO"       [2018-06-27 Wed 14:33]
     input    logic [1:0]          ptpMicroSemiLoadSaveInP    ,
     input    logic [1:0]          ptpMicroSemiLoadSaveInN    ,

     input    logic                clockSynce25In             ,
     Read the register on ptp_server module.
*** CANCELLED irqOut
    CLOSED: [2018-06-28 Thu 16:23]
    output   logic                irqOut_n                   ,
    has not test, How to test?/!
*** CANCELLED rxClkSelOut
    CLOSED: [2018-06-29 Fri 10:12]
    output   logic [5:0]          rxClkSelOut                ,
    10G mode, 156.25Mhz
    25G mode, 390.625Mhz
    100G mode, 322.625Mhz
    1G mode, 125Mhz
    Config clock sel, enable and divider factor by register, then check/monitor the output clock's frequency.
*** DONE dyingGaspIn
    CLOSED: [2018-06-28 Thu 16:13]
    - State "DONE"       from "TODO"       [2018-06-28 Thu 16:13]
    input    logic                dyingGaspIn                ,
    add it to dyinggasp generation testcase. keep internal register trigger as 0, change it value form 0 to 1 (on top.sv) 5 times, the expected result is 5 times dying gasp frame generated.
*** TODO WEST/EAST fp_los data, clk pin test tc_1001, test fail, need Haidong or Tonny doulbe check
    - State "TODO"       from "DONE"       [2018-06-29 Fri 09:28]
    - State "DONE"       from "TODO"       [2018-06-28 Thu 18:13]
   .fpgaWestClkIn              (),  //input
   .fpgaWestFpIn               (),  //input
   .fpgaWestDataIn             (),  //input
   .fpgaWestClkOut             (),  //output
   .fpgaWestFpOut              (),  //output
   .fpgaWestDataOut            (),  //output
   .fpgaEastClkIn              (),  //input
   .fpgaEastFpIn               (),  //input
   .fpgaEastDataIn             (),  //input
   .fpgaEastClkOut             (),  //output
   .fpgaEastFpOut              (),  //output
   .fpgaEastDataOut            (),  //output
** DONE PTP full bandwidth. [100%]
   CLOSED: [2018-05-30 Wed 19:24]
   - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
   :LOGBOOK:  
   CLOCK: [2018-05-30 Wed 14:49]--[2018-05-30 Wed 15:08] =>  0:19
   :END:      
*** DONE tc_503 All port input PTP packet with full bandwidth.[100%] 
    CLOSED: [2018-05-30 Wed 19:00]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:00]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 18:32]--[2018-05-30 Wed 18:59] =>  0:27
    CLOCK: [2018-05-30 Wed 18:01]--[2018-05-30 Wed 18:06] =>  0:05
    CLOCK: [2018-05-30 Wed 17:23]--[2018-05-30 Wed 17:31] =>  0:08
    :END:      
    - [X] all inress port input full bandwith traffic with PTP packet.<2018-05-30 Wed 18:59> 
**** DONE TF side need double check.<2018-05-30 Wed 19:26> 
     CLOSED: [2018-05-31 Thu 09:43]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 09:43]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 09:38]--[2018-05-31 Thu 09:43] =>  0:05
     CLOCK: [2018-05-31 Thu 08:32]--[2018-05-31 Thu 09:21] =>  0:49
     :END:      
    - [X] all egress port input full bandwith traffic with PTP packet, disable overwrite SA on mac_tx.
     when set every flow input 400 packets, there are miscmp errors; Need Tonny to double check it. <2018-05-30 Wed 17:30>
      In the ptp_process spec, about setting updateCorrectField condition is not clear, after disscution with tonny, TF need do modificaiton, if packet is event ptp, and allowopertion, set the updateCorrectField; don't care the egrRxIfPortNum any more. later, tonny wiil update the spec also. 
*** DONE tc_504 All port input PTP and non-PTP packet with full bandwidth.[100%]
    CLOSED: [2018-05-30 Wed 19:07]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:07]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:00]--[2018-05-30 Wed 19:07] =>  0:07
    CLOCK: [2018-05-30 Wed 16:21]--[2018-05-30 Wed 16:22] =>  0:01
    CLOCK: [2018-05-30 Wed 15:58]--[2018-05-30 Wed 16:10] =>  0:12
    CLOCK: [2018-05-30 Wed 15:54]--[2018-05-30 Wed 15:55] =>  0:01
    :END:      
    - [X] all egress port input full bandwidth traffic, PTP and non-PTP, disable overwrite SA on mac_tx.
    - [X] all ingress port input full bandwidth traffic, PTP and non-PTP.<2018-05-30 Wed 19:07> 
*** DONE align the related testcase form 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 19:24]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
    - State "TODO"       from "DONE"       [2018-05-30 Wed 19:09]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:18]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:10]--[2018-05-30 Wed 19:21] =>  0:11
    CLOCK: [2018-05-30 Wed 15:41]--[2018-05-30 Wed 15:42] =>  0:01
    CLOCK: [2018-05-30 Wed 15:31]--[2018-05-30 Wed 15:37] =>  0:06
    CLOCK: [2018-05-30 Wed 15:12]--[2018-05-30 Wed 15:18] =>  0:06
    :END:      
    - [X] tc_503 
    - [X] tc_504
** DONE more details RMON test for mac_rx/tx [100%]
*** DONE all kinds of type RMON test for mac rx/tx [100%]
     CLOSED: [2018-05-30 Wed 09:32]
     - State "DONE"       from "TODO"       [2018-05-30 Wed 09:32]
   - [X] tc_207, re-prduce lab test bug. without transceiver, 64B packet with GOOD/BAD/GOOD/BAD FCS; 
     port0 input 64B packet, port1 input 200B packet; 
     port2 port3 input packet with some phy error (PCS error); 
     port4 input 128B packet with all FCS error. 
     port5 input 129B packet with all FCS error.
   - [X] tc_208, cover all kinds of type RMON for mac_rx/tx 
   - [X] tc_208a, to test RMON with MTU less 1518
*** DONE Normal traffic full bandwidth with RX input some fcs errors. [100%]
    CLOSED: [2018-05-23 Wed 15:27]
   - State "DONE"       from "STARTED"    [2018-05-23 Wed 15:27]
   - [X] with transceiver core. input packet size is 1500
   - [X] bypass transceiver core. input packet size is 1500
*** DONE Align the all related testcase between xg480_phy_25g and xg480_phy_10g device [100%]
    CLOSED: [2018-05-30 Wed 14:48]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 14:48]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 14:41]--[2018-05-30 Wed 14:43] =>  0:02
    CLOCK: [2018-05-30 Wed 14:29]--[2018-05-30 Wed 14:37] =>  0:08
    CLOCK: [2018-05-30 Wed 14:04]--[2018-05-30 Wed 14:10] =>  0:06
    CLOCK: [2018-05-30 Wed 11:59]--[2018-05-30 Wed 12:13] =>  0:14
    CLOCK: [2018-05-30 Wed 11:49]--[2018-05-30 Wed 11:50] =>  0:01
    :END:      
    - [X] tc_208
    - [X] tc_208a
** DONE Support Haidong lab test [100%]
   CLOSED: [2018-05-31 Thu 10:58]
   - State "DONE"       from "TODO"       [2018-05-31 Thu 10:58]
*** DONE generation the dyinggasp injection testcase all provisionging
    CLOSED: [2018-05-31 Thu 10:58]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 10:58]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 10:31]--[2018-05-31 Thu 10:39] =>  0:08
    CLOCK: [2018-05-31 Thu 09:48]--[2018-05-31 Thu 10:00] =>  0:12
    :END:      
    based on tc_201b, grep all procWrite.
** DONE align the testcase between xg480_phy_25g and xg480_phy_10g [100%]
   CLOSED: [2018-05-31 Thu 16:45]
   - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:45]
   :LOGBOOK:  
   CLOCK: [2018-05-31 Thu 16:14]--[2018-05-31 Thu 16:18] =>  0:04
   :END:      
*** DONE tc_201b, from 25g to 10g device, dyinggasp injection.
    CLOSED: [2018-05-31 Thu 14:04]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 14:04]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 13:58]--[2018-05-31 Thu 14:02] =>  0:04
    CLOCK: [2018-05-31 Thu 11:04]--[2018-05-31 Thu 11:28] =>  0:24
    :END:      

*** DONE tc_201c, from 25g to 10g device, dyinggasp injection, non-zero time prov.
    CLOSED: [2018-05-31 Thu 15:43]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 15:43]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 14:45]--[2018-05-31 Thu 14:49] =>  0:04
    CLOCK: [2018-05-31 Thu 14:31]--[2018-05-31 Thu 14:42] =>  0:11
    CLOCK: [2018-05-31 Thu 14:23]--[2018-05-31 Thu 14:24] =>  0:01
    :END:      
*** DONE tc_201,tc_201a; from 25g to 10g device, pause injection
    CLOSED: [2018-05-31 Thu 15:43]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 15:43]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 14:42]--[2018-05-31 Thu 14:45] =>  0:03
    CLOCK: [2018-05-31 Thu 14:25]--[2018-05-31 Thu 14:31] =>  0:06
    CLOCK: [2018-05-31 Thu 14:07]--[2018-05-31 Thu 14:19] =>  0:12
    :END:      
*** DONE tc_200, from 25g to 10g device, mac_rx/tx basic function testcase
    CLOSED: [2018-05-31 Thu 16:14]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:14]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 16:11]--[2018-05-31 Thu 16:14] =>  0:03
    CLOCK: [2018-05-31 Thu 15:57]--[2018-05-31 Thu 16:01] =>  0:04
    CLOCK: [2018-05-31 Thu 15:44]--[2018-05-31 Thu 15:54] =>  0:10
    :END:      
*** DONE tc_004a, external reset test. if it set, DUT should do nothing.
    CLOSED: [2018-05-31 Thu 16:44]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:44]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 16:32]--[2018-05-31 Thu 16:36] =>  0:04
    CLOCK: [2018-05-31 Thu 16:20]--[2018-05-31 Thu 16:22] =>  0:02
    :END:      

** DONE Lbus frame interface test for 100G mode.[93%]
   CLOSED: [2018-06-25 Mon 18:36]
   - State "DONE"       from "TODO"       [2018-06-25 Mon 18:36]
   - State "STARTED"    from "DONE"       [2018-06-25 Mon 11:12]
   - State "DONE"       from "TODO"       [2018-06-19 Tue 12:24]
*** DONE tc_006,  CGMII_LOOP, rate:80G, packet size 5000B, input 2000 packets. testcase ready
*** DONE tc_006a, CGMII to LBUS, LBUS to CGMII, 100G, flow0 3000B, flow1 200B, testcase ready
    CLOSED: [2018-06-19 Tue 12:25]
    - State "DONE"       from "STARTED"    [2018-06-19 Tue 12:25]
    :LOGBOOK:  
    CLOCK: [2018-06-12 Tue 08:45]--[2018-06-12 Tue 08:52] =>  0:07
    CLOCK: [2018-06-08 Fri 11:02]--[2018-06-08 Fri 11:19] =>  0:17
    :END:      
    tc_006a, 2flows, 200 and 3000 bytes; it's re-produce the lab issue.
    the issue is the lbus 's ENA is not (1 3 7 or 0xf). Leo has fixed the issue.
*** DONE tc_006b, CGMII to LBUS, LBUS to CGMII, 100G, 64 to 256 random, testcase ready
    CLOSED: [2018-06-08 Fri 17:44]
    - State "DONE"       from "STARTED"    [2018-06-08 Fri 17:44]
    :LOGBOOK:  
    CLOCK: [2018-06-08 Fri 17:18]--[2018-06-08 Fri 17:44] =>  0:26
    :END:      
*** DONE tc_006c, CGMII to LBUS, LBUS to CGMII, 100G, 64 to 9600 random, testcase ready
    CLOSED: [2018-06-08 Fri 18:33]
    - State "DONE"       from "STARTED"    [2018-06-08 Fri 18:33]
    :LOGBOOK:  
    CLOCK: [2018-06-08 Fri 18:26]--[2018-06-08 Fri 18:33] =>  0:07
    CLOCK: [2018-06-08 Fri 17:44]--[2018-06-08 Fri 17:49] =>  0:05
    :END:      
*** DONE tc_006d, CGMII to LBUS, LBUS to CGMII, 100G, flow0 64 - 256B, flow1 64 - 9600B, testcase ready
*** DONE tc_006e, CGMII to LBUS, LBUS to CGMII, 100G 64 65 97 80 81 110 111 112 245 246 257B, one by one size input, every size input 50us testcase ready
*** DONE tc_006f, CGMII to LBUS, LBUS to CGMII, 100G 64 65 97 80 81 110 111 112 245 246 257B, in the same time input, every size input 200 packets testcase ready
*** DONE tc_006g, CGMII_LOOP, 100G 65B, testcase ready
*** DONE tc_006h, CGMII_LOOP, 100G 81B, testcase ready
*** DONE tc_006i, CGMII_LOOP, 100G 81B, testcase ready
*** DONE tc_006j, CGMII_LOOP, 100G 64 128 192 256 320 384B, testcase ready
*** DONE tc_006k, CGMII_LOOP, 100G 9600B, testcase ready
*** STARTED tc_006k, 9600B CGMII_LOOP, fail when regression, Leo checking. <2018-07-16 Mon 18:05>
    - State "STARTED"    from "DONE"       [2018-07-16 Mon 19:06]
    - State "DONE"       from "STARTED"    [2018-07-16 Mon 19:05]
      revert the leo's modificaion of frame to cgmii. buffer form 16 to 10 to re-produce the seg_buffer issue. to re-produce the seg_buffer issue.
*** DONE normal traffic with loopback traffic. to test arbitration [100%]
    CLOSED: [2018-06-25 Mon 14:34]
    - State "DONE"       from "TODO"       [2018-06-25 Mon 14:34]
**** DONE normal traffic with fac looback tc_309 (100g mode), tc_311 (25G mode)
     CLOSED: [2018-06-25 Mon 14:13]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 14:13]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 14:06]--[2018-06-25 Mon 14:07] =>  0:01
     CLOCK: [2018-06-25 Mon 12:00]--[2018-06-25 Mon 12:04] =>  0:04
     CLOCK: [2018-06-25 Mon 11:51]--[2018-06-25 Mon 11:57] =>  0:06
     CLOCK: [2018-06-25 Mon 11:13]--[2018-06-25 Mon 11:26] =>  0:13
     CLOCK: [2018-06-25 Mon 10:40]--[2018-06-25 Mon 10:55] =>  0:15
     :END:      
**** DONE normal traffic with termail loopback tc_310 (100G mode) tc_312 (25G mode)
     CLOSED: [2018-06-25 Mon 14:34]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 14:34]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 14:29]--[2018-06-25 Mon 14:34] =>  0:05
     CLOCK: [2018-06-25 Mon 14:07]--[2018-06-25 Mon 14:13] =>  0:06
     CLOCK: [2018-06-25 Mon 12:05]--[2018-06-25 Mon 12:17] =>  0:12
     CLOCK: [2018-06-25 Mon 11:01]--[2018-06-25 Mon 11:09] =>  0:08
     :END:      
**** DONE tc_309 re-run TCs when desinger fixing bug. (The bug: arbitration cannot always correctly work when normal traffic and lpbk traffic are valid in the same time.)
     CLOSED: [2018-07-16 Mon 14:03]
     - State "DONE"       from "STARTED"    [2018-07-16 Mon 14:03]
     :LOGBOOK:  
     CLOCK: [2018-07-05 Thu 11:36]--[2018-07-05 Thu 12:01] =>  0:25
     :END:      
     re-run tc_309,<2018-07-05 Thu 12:09> result:
     normal traffic is 50G, 900 packets, all output.
     loop traffic is 50G, 900 packets, just half output. it's not expected. haidong is checking on it. <2018-07-05 Thu 12:11>
*** DONE setup the illegal traffic input the DUT, DUT should not lock.[100%]
    CLOSED: [2018-06-25 Mon 18:36]
    - State "DONE"       from "TODO"       [2018-06-25 Mon 18:36]
**** DONE NGMII interface input the illegal traffic
     CLOSED: [2018-06-25 Mon 17:28]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 17:28]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 16:37]--[2018-06-25 Mon 17:28] =>  0:51
     CLOCK: [2018-06-25 Mon 14:21]--[2018-06-25 Mon 14:29] =>  0:08
     CLOCK: [2018-06-25 Mon 11:57]--[2018-06-25 Mon 12:00] =>  0:03
     :END:      
     tc_020, ngmii driver gen 70% phy errors.
**** DONE CGMII interface input the illegal traffic
     CLOSED: [2018-06-25 Mon 18:36]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 18:36]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 17:28]--[2018-06-25 Mon 18:36] =>  1:08
     :END:      

*** DONE update the cmac lbus monitor, if rx_rdy is 0 and sop has been valid, max allow 4.
    CLOSED: [2018-07-05 Thu 11:34]
    - State "DONE"       from "STARTED"    [2018-07-05 Thu 11:34]
    :LOGBOOK:  
    CLOCK: [2018-07-05 Thu 10:33]--[2018-07-05 Thu 11:00] =>  0:27
    CLOCK: [2018-07-05 Thu 09:56]--[2018-07-05 Thu 10:08] =>  0:12
    :END:      
** TODO all control and status register test [%]
   tc_1002.
*** TODO normal traffc running, monitor the all underflow overflow indication registers, they should not asserted
    tc_common_base.sv
    Before running traffic, ROC all the underflow overflow indication registers.
** DONE random disable/enable interface, the DUT should not lock . [100%]
   CLOSED: [2018-07-03 Tue 16:06]
   - State "DONE"       from "STARTED"    [2018-07-03 Tue 16:06]
*** DONE 25G device 25G mode, tc_004a random disable/enable NGMII interface.
    CLOSED: [2018-07-03 Tue 15:46]
    - State "DONE"       from "TODO"       [2018-07-03 Tue 15:46]
    tc_004a.
**** TODO tc_004a more times disable/enable ngmii, DUT output fragment of packet, it should not; Waiting Tonny to doulbe check and fixed it.
*** DONE 25G device 10G mode, tc_003a random disable/enable NGMII interface.
    CLOSED: [2018-07-03 Tue 16:06]
    - State "DONE"       from "TODO"       [2018-07-03 Tue 16:06]
    tc_003a
*** DONE 25G device 100G mode, tc_006l random disable/enable CGMII interface.
    CLOSED: [2018-07-03 Tue 15:58]
    - State "DONE"       from "TODO"       [2018-07-03 Tue 15:58]
    Need DUT (CGMII) support register prov interface disable/enable.
    tc_006l
*** DONE 25G device 100G mode, tc_006l random disable/enable LBUS interface.
    CLOSED: [2018-07-03 Tue 15:58]
    - State "DONE"       from "TODO"       [2018-07-03 Tue 15:58]
    Need DUT (LBUS) support register prov interface disable/enable
    tc_006l
*** DONE 10G device 10G mode, tc_004a random disable/enable NGMII interface.
    CLOSED: [2018-07-13 Fri 14:24]
    - State "DONE"       from "TODO"       [2018-07-13 Fri 14:24]
*** DONE 10G device 1G mode, tc_003a random disable/enable NGMII interface.
    CLOSED: [2018-07-13 Fri 14:38]
    - State "DONE"       from "TODO"       [2018-07-13 Fri 14:38]
** CANCELLED 10G 25G 100G interface if support the LPI 
   CLOSED: [2018-07-11 Wed 14:55]
   Tonny said, DUT don't support on this release.
** DONE sys side traffic packet with ITMH/OTMH [80%]
   CLOSED: [2018-07-11 Wed 14:46]
   - State "DONE"       from "STARTED"    [2018-07-11 Wed 14:46]
   :LOGBOOK:  
   CLOCK: [2018-07-05 Thu 09:32]--[2018-07-05 Thu 09:56] =>  0:24
   :END:      
*** DONE the eth_agent need one more layer after ethernet layer before phy layer.
    CLOSED: [2018-07-06 Fri 14:45]
    - State "DONE"       from "STARTED"    [2018-07-06 Fri 14:45]
    :LOGBOOK:  
    CLOCK: [2018-07-05 Thu 14:33]--[2018-07-05 Thu 16:09] =>  1:36
    :END:      
*** DONE modify all phy_*_constraints.sv. 
    CLOSED: [2018-07-06 Fri 14:45]
    - State "DONE"       from "TODO"       [2018-07-06 Fri 14:45]
    the line side don't gen ITMH/OTMH, but sys-side need gen ITMH. 
*** DONE the eth_object_parser need parser OTMH.
    CLOSED: [2018-07-09 Mon 18:41]
    - State "DONE"       from "STARTED"    [2018-07-09 Mon 18:41]
    :LOGBOOK:  
    CLOCK: [2018-07-09 Mon 18:27]--[2018-07-09 Mon 18:41] =>  0:14
    CLOCK: [2018-07-09 Mon 11:44]--[2018-07-09 Mon 11:50] =>  0:06
    CLOCK: [2018-07-06 Fri 14:57]--[2018-07-06 Fri 15:16] =>  0:19
    :END:      

*** DONE CGMII IF ADVA HDR test
    CLOSED: [2018-07-10 Tue 18:48]
    - State "DONE"       from "STARTED"    [2018-07-10 Tue 18:48]
    :LOGBOOK:
    CLOCK: [2018-07-10 Tue 16:17]--[2018-07-10 Tue 18:48] =>  2:31
    CLOCK: [2018-07-10 Tue 14:48]--[2018-07-10 Tue 14:56] =>  0:08
    :END:
**** DONE tc_006m EGRESS (CGMII RX) test, CGMII IF ADVA HDR support.  
     CLOSED: [2018-07-10 Tue 18:52]
     - State "DONE"       from "TODO"       [2018-07-10 Tue 18:52]
**** DONE tc_006m IGRESS (CGMII TX) test, CGMII IF ADVA HDR support. 
     CLOSED: [2018-07-11 Wed 14:46]
     - State "DONE"       from "STARTED"    [2018-07-11 Wed 14:46]
     :LOGBOOK:  
     CLOCK: [2018-07-10 Tue 18:54]--[2018-07-10 Tue 19:13] =>  0:19
     :END:      
     CGMII_TX monitor need add the fcs re-calc function.
     eth_object_parser need add the adva hdr support mode.
*** WAITING NGMII IF ADVA HDR test, need NGMII RTL support. waiting Tonny 
** DONE Help Atlanta Mike check the T_dcn_switch_v1.0_r112857 regression results [100%]
   CLOSED: [2018-07-10 Tue 12:25] DEADLINE: <2018-07-12 Thu>
   - State "DONE"       from "STARTED"    [2018-07-10 Tue 12:25]
   :LOGBOOK:  
   CLOCK: [2018-07-09 Mon 14:22]--[2018-07-09 Mon 14:47] =>  0:25
   :END:      
*** DONE dcn_switch tc_009 checking, ATL 13 errors, SZX no errors
    CLOSED: [2018-07-10 Tue 12:24] SCHEDULED: <2018-07-09 Mon>
    - State "DONE"       from "STARTED"    [2018-07-10 Tue 12:24]
    :LOGBOOK:  
    CLOCK: [2018-07-09 Mon 14:47]--[2018-07-09 Mon 15:21] =>  0:34
    :END:      
    after double checking the tc009 from Mike, the ATL run tc_009 with 1 ETH 9 FRMs mode. However, SZX run tc_009 with 2 ETHs 8 FRMs mode. double checking the svn log, it has been said on 2017-09-27 r107278, For tc_009, the default is 2 ETH port test.
    ../../../scripts/run_sim_questa -local_output off -database local_db
    -set_ethernet_port 2
*** DONE dcn_switch tc_009a checking, ATL 57011 errors, SZX ?
    CLOSED: [2018-07-10 Tue 12:23] SCHEDULED: <2018-07-09 Mon>
    - State "DONE"       from "TODO"       [2018-07-10 Tue 12:23]
    to test frm interface backpreasure. The DUT has overflow, so the result will have the OVM_ERROR， missing and mismatch errors. It’s expected.   The testcase is not regression. 
*** CANCELLED dcn_switch tc_017b checking, ATL 7 errors, SZX ?
    CLOSED: [2018-07-11 Wed 14:58] SCHEDULED: <2018-07-09 Mon>
    - State "STARTED"    from "DONE"       [2018-07-10 Tue 12:24]
    - State "DONE"       from "TODO"       [2018-07-10 Tue 12:24]
      DUT joiner is not support padding on this release. TF has beed support. the case is fail. It’s expected. The testcase is not regression
*** DONE dch_switch tc_018 checking, ATL 550 errors, SZX ?
    CLOSED: [2018-07-10 Tue 12:24] SCHEDULED: <2018-07-10 Tue>
    - State "DONE"       from "TODO"       [2018-07-10 Tue 12:24]
    ETH0 to DCN0. Queue overflow Indication Register verify. The DUT has overflow, so the result will have the OVM_ERROR， missing and mismatch errors. It’s expected.   The testcase is not regression  
*** DONE dcn_switch tc_020 checking, ATL 60 errors, SZX ?
    CLOSED: [2018-07-10 Tue 12:24] SCHEDULED: <2018-07-10 Tue>
    - State "DONE"       from "TODO"       [2018-07-10 Tue 12:24]
    MS almost full discard test,  the memory system will drop yellow frames when queue  reach almost full.  the result will have the OVM_ERROR，It’s expected.   The testcase is not regression
*** DONE dcn_switch tc_021 checking, ATL 23 errors, SZX no errors.
    CLOSED: [2018-07-10 Tue 12:25] SCHEDULED: <2018-07-11 Wed>
    ../../../scripts/run_sim_questa -local_output off -database local_db
    -set_ethernet_port 4
*** DONE dcn_switch tc_022 checking, ATL 5 errors, SZX no errors.
    CLOSED: [2018-07-10 Tue 12:25] SCHEDULED: <2018-07-11 Wed>
    ../../../scripts/run_sim_questa -local_output off -database local_db
    -set_ethernet_port 2
** DONE individually bypass transceivers.
   CLOSED: [2018-07-12 Thu 19:06]
   - State "DONE"       from "TODO"       [2018-07-12 Thu 19:06]
   BYPASS_TRANSCEIVER_0 for Line0, port0-3
   BYPASS_TRANSCEIVER_1 for Line1, port4-7
   BYPASS_TRANSCEIVER_2 for Sys0, port8-11
   BYPASS_TRANSCEIVER_3 for Sys1, port12-15
** DONE tc_007a 100G mode, to test and debug the xco4ma soft core. Bypass all transceivers expect xco4ma soft 100G core.
   CLOSED: [2018-07-13 Fri 09:34]
   - State "DONE"       from "STARTED"    [2018-07-13 Fri 09:34]
   - State "STARTED"    from "DONE"       [2018-07-13 Fri 09:34]
   - State "DONE"       from "TODO"       [2018-07-12 Thu 19:08]
   tc_007a, 100G mode, to test and debug the xco4ma soft core.
   pipe0 has traffic, 
   LINE side: bypass transceiver(CMAC), LBUS input traffic.
   SYS side:  don't bypass transceiver, CGMII connect to xco4ma core then connect to GTY.
   pipe1 no traffic,
   LINE and SYS side both bypass transceiver, make testcase run faster.
     
** TODO xg480_sys_timing v2.0 PCIE (DMA mode) interface verification [%] 
*** TODO waiting Tonny to generate the Root mode core.
*** TODO integrate the Root and EP core to TB.
   
* load sharing regression support for xg480 phy device. [0%]
** STARTED update sys-sim.mk base on xgPro style.
   :LOGBOOK:  
   CLOCK: [2018-07-20 Fri 16:24]--[2018-07-20 Tue 18:25] =>  2:01
   CLOCK: [2018-07-20 Fri 15:01]--[2018-07-20 Fri 15:31] =>  0:30
   CLOCK: [2018-07-11 Wed 18:01]--[2018-07-11 Wed 18:32] =>  0:31
   :END:      
 
** TODO based on the PRI number to generate the tc list (yaml format)
** STARTED on Wednesday, regression the short time running testcase
   :LOGBOOK:  
   CLOCK: [2018-07-25 Wed 09:45]--[2018-07-25 Wed 10:52] =>  1:07
   :END:      
** TODO on Weekend, regression all testcases (long time testcase and short time testcase)


* review test plan <2018-07-19 Thu 16:36> [83%]
** DONE the RMON (eth_stats) test [100%]
   CLOSED: [2018-08-22 Wed 10:45]
   - State "DONE"       from "TODO"       [2018-08-22 Wed 10:45]
*** DONE termnal loop mode, blocked packet should be counter by eth_stat, tc_301 pass 
    CLOSED: [2018-07-20 Fri 11:09]
    - State "DONE"       from "STARTED"    [2018-07-20 Fri 11:09]
    :LOGBOOK:  
    CLOCK: [2018-07-20 Fri 09:05]--[2018-07-20 Fri 09:48] =>  0:43
    :END:      
*** DONE tc_202 pause has own couter in RMON, shoud not count by Mcast. whatever pause action in mac rx [50%]
    CLOSED: [2018-07-19 Thu 18:52]
    - State "DONE"       from "STARTED"    [2018-07-19 Thu 18:52]
    :LOGBOOK:  
    CLOCK: [2018-07-19 Thu 17:56]--[2018-07-19 Thu 18:52] =>  0:56
    :END:      
**** DONE DUT has bug, the pasue should not count by Macst, should count to pause.
     CLOSED: [2018-07-20 Fri 09:00]
     - State "DONE"       from "TODO"       [2018-07-20 Fri 09:00]
**** WAITING tc202 fail, becasue DUT mac_rx has not implemented the pause action funciton.
     - State "TODO"       from "WAITING"    [2018-07-20 Fri 09:08]
*** DONE double check y1564 related RMON [100%]
    CLOSED: [2018-08-22 Wed 10:44]
    - State "DONE"       from "TODO"       [2018-08-22 Wed 10:44]
   with normal traffic together test.
**** DONE down mon, no rmon. tc_400 has been covered 
     CLOSED: [2018-08-22 Wed 10:44]
     - State "DONE"       from "TODO"       [2018-08-22 Wed 10:44]
**** DONE up mon, has rmon.  tc_400 has been covered
     CLOSED: [2018-08-22 Wed 10:44]
     - State "DONE"       from "TODO"       [2018-08-22 Wed 10:44]
**** DONE up gen, has rmon.  tc_402 has been covered
     CLOSED: [2018-08-22 Wed 10:44]
     - State "DONE"       from "TODO"       [2018-08-22 Wed 10:44]
**** DONE down gen, no rmon. tc_402 has been covered
     CLOSED: [2018-08-22 Wed 10:44]
     - State "DONE"       from "TODO"       [2018-08-22 Wed 10:44]
** DONE tc_007 double check. has fatel error. After cleanup the defines in tb_env.sv, the fatel has gone.
   CLOSED: [2018-07-19 Thu 16:28]
   - State "DONE"       from "STARTED"    [2018-07-19 Thu 16:28]
   :LOGBOOK:  
   CLOCK: [2018-07-19 Thu 15:43]--[2018-07-19 Thu 16:28] =>  0:45
   :END:      
** DONE add tc_007a to test plan
   CLOSED: [2018-07-19 Thu 16:34]
   - State "DONE"       from "STARTED"    [2018-07-19 Thu 16:34]
   :LOGBOOK:  
   CLOCK: [2018-07-19 Thu 16:29]--[2018-07-19 Thu 16:34] =>  0:05
   :END:      
** STARTED all port have normal + loop traffic (some vlans are loops, some vlans are normal) test.[66%]
   :LOGBOOK:  
   CLOCK: [2018-07-20 Fri 13:40]--[2018-07-20 Fri 14:21] =>  0:41
   :END:      
   loop + normal + y1564 gen. (if egress + pause + dying gasp gen)
   The PRI is: dyinggasp > pause > normal traffic > loop > y1546 
*** DONE tc_410 25G mode in pipe1, 100G mode in pipe0 (ku5p)
    CLOSED: [2018-08-23 Thu 11:10]
    - State "DONE"       from "STARTED"    [2018-08-23 Thu 11:10]
    :LOGBOOK:  
    CLOCK: [2018-08-23 Thu 09:51]--[2018-08-23 Thu 11:08] =>  1:17
    CLOCK: [2018-08-22 Wed 18:03]--[2018-08-22 Wed 18:46] =>  0:43
    CLOCK: [2018-08-22 Wed 17:44]--[2018-08-22 Wed 17:54] =>  0:10
    CLOCK: [2018-08-22 Wed 16:53]--[2018-08-22 Wed 17:17] =>  0:24
    :END:      
    pipe0 100g mode, the y1564 gen must prov to single mode. 
    ingress(up) y1564 gen disable, because it output from cgmii, cgmii don't calc FCS, eth_object_parser will report useless uvm_error.
    egress (down) y1564 gen is normal.

*** DONE tc_411 25G mode in pipe1, 100G mode in pipe0 (ku5p)
    CLOSED: [2018-08-23 Thu 14:26]
    - State "DONE"       from "STARTED"    [2018-08-23 Thu 14:26]
    pipe1 25g mode
    ingress (up) y1564 gen is normal.
    egress (down) y1564 gen is normal. port6 10G y1564 injection, 5G fac_loop(port6 to port6), 10G normal traffic (port14 to port6)


*** TODO 10G mode in 10G device (ku3p)
** DONE tc_002a, 25G 65B full bandwidth test fail, DUT has bug.(Need tonny double check)
   CLOSED: [2018-08-20 Mon 11:17]
   - State "DONE"       from "TODO"       [2018-08-20 Mon 11:17]
   input 25Gpbs, 65B packet,  DUT out add more then 12 Bytes IPG.
   Tonny has fiexed the bug on 15th Aug 2018

** DONE full bandwidth with segment size boundary packet size.[100%]
   CLOSED: [2018-08-22 Wed 15:29]
   - State "DONE"       from "TODO"       [2018-08-22 Wed 15:29]
*** DONE tc_002b 10G device
    CLOSED: [2018-08-22 Wed 15:29]
    - State "DONE"       from "TODO"       [2018-08-22 Wed 15:29]
    Port0, 2, 4, 6
    context0: 125 ~ 128
    context1: 129 ~ 132
    context2: 133
    context3: 141
    context4-21: 149 + (contextId-4)*8
    
    Port1, 3, 5, 7
    context0: 128+125 ~ 128+128
    context1: 128+129 ~ 132+128
    context2: 128+133
    context3: 128+141
    context4-21: 128+149 + (contextId-4)*8

*** DONE tc_002b 25G device
    CLOSED: [2018-08-22 Wed 15:19]
    - State "DONE"       from "TODO"       [2018-08-22 Wed 15:19]
    Port0, 2, 4, 6
    context0: 125 ~ 128
    context1: 129 ~ 141
    context2-12: 142 + (contextId-2)*16
    
    Port1, 3, 5, 7
    context0: 128+125 ~ 128+128
    context1: 128+129 ~ 128+141
    context2-12: 128+142 + (contextId-2)*16


* pipeline structure modification [100%]
** DONE mac_tx transfer_function comments out the pause and dying gasp related prov register. 
   CLOSED: [2018-07-31 Tue 14:17]
   - State "DONE"       from "TODO"       [2018-07-31 Tue 14:17]
** DONE in mac_tx transfer_function re-add the pause and dying gasp related prov register based on pause_dgasp_inj module. 
   CLOSED: [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
** DONE port_parser_transfer_function comments out "DEF_MACRX_CTX_HIGHEST_MDL_PROV_ADDRX". 
   CLOSED: [2018-08-08 Wed 14:28]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:28]
   - State "TODO"       from "DONE"       [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
** DONE ptp_process_transfer_function. 
   CLOSED: [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
   //bit [`DEF_MACTX_SYS_PORT_SYS_PORT_SIZE-1:0] egrRxIfPortNum;
      //bit [`DEF_MACTX_CTX_PTP_TX_LATENCY_PROV_TX_LATENCY_SIZE-1:0] txLatency;
      //bit [`DEF_MACRX_CTX_PTP_RX_LATENCY_PROV_RX_LATENCY_SIZE-1:0] rxFixedLatency;
      //bit [`DEF_MACRX_CTX_PORT_PROV_PORT_NUM_SIZE-1:0]             rxPortNum;
   //bit [`DEF_MACTX_SYS_PORT_SYS_PORT_SIZE-1:0]                     sysPortNum;
//                 `DEF_MACRX_CTX_PTP_RX_LATENCY_PROV_ADDRX: begin
//                 `DEF_MACTX_CTX_PTP_TX_LATENCY_PROV_ADDRX: begin
** DONE ptp_editor transfer function
   CLOSED: [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
   //bit [`DEF_MACTX_SYS_PORT_SYS_PORT_SIZE-1:0] egrRxIfPortNum;
   //bit [`DEF_MACTX_SYS_PORT_SYS_PORT_SIZE-1:0]                     sysPortNum;
** DONE mac_rx_methods.svh [100%]
   CLOSED: [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
   line 146
*** DONE has been finished
    CLOSED: [2018-08-01 Wed 16:42]
    - State "DONE"       from "TODO"       [2018-08-01 Wed 16:42]
         //writeData1 = 0;
         //writeData1[`DEF_MACRX_CTX_HIGHEST_MDL_PROV_MDL_BITS] = p.highestMdl[i];
         //writeAddress1 = 0;
         //writeAddress1 = `DEF_MACRX_CTX_HIGHEST_MDL_PROV_BASE + (i*4) + baseAddrOffset;

*** DONE move the ptp related provisioning method to ptp_porcess methodss.svh
    CLOSED: [2018-08-01 Wed 16:43]
    - State "DONE"       from "TODO"       [2018-08-01 Wed 16:43]
         //writeData2 = p.rxFixedLatency[i];
         //writeAddress2 = 0;
         //writeAddress2 = `DEF_MACRX_CTX_PTP_RX_LATENCY_PROV_BASE + (i*4) + baseAddrOffset;

         //writeData3 = 0;
         //writeData3[`DEF_MACRX_CTX_PTP_PROV_PTP_TRANSPORT_TYPE_BITS] = p.ptpTransportType[i];
         //writeAddress3 = 0;
         //writeAddress3 = `DEF_MACRX_CTX_PTP_PROV_BASE + (i*4) + baseAddrOffset;

         //writeData4 = 0;
         //writeData4[`DEF_MACRX_CTX_PORT_PROV_PORT_NUM_BITS] = p.rxPortNum[i];
         //writeAddress4 = 0;
         //writeAddress4 = `DEF_MACRX_CTX_PORT_PROV_BASE + (i*4) + baseAddrOffset;

   line 180 - 202
** DONE mac_tx_methods.svh
   CLOSED: [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
   pasu and dying gase injection.
   line 163 - 226
   line 259 - 342
   line 348 - 374
   line 412 - 495 

   ptp related
   line 605 -624
   line 627 -645
   line 650 -672
   line 675 -691

   line 697 -742
   line 798 -861
   line 887 -950
   line 976 -1039
   line 1060 -1078
   line 1092 -1108
   line 1123 -1152
** DONE lpbk_y1564_det_methods.svh
   CLOSED: [2018-08-08 Wed 14:27]
   - State "DONE"       from "TODO"       [2018-08-08 Wed 14:27]
   line 140-145
//            if      (p.constraintSelector == 0) `lpbkCtrlZeroTimeProv(i,0)
//            else if (p.constraintSelector == 1) `lpbkCtrlZeroTimeProv(i,1)
//            else if (p.constraintSelector == 2) `lpbkCtrlZeroTimeProv(e,0)
//            else if (p.constraintSelector == 3) `lpbkCtrlZeroTimeProv(e,1)
   line 212-218
//            if      (p.constraintSelector == 0) begin `lpbkDaZeroTimeProv(i,0) `lpbkSaZeroTimeProv(i,0) `lpbkLaZeroTimeProv(i,0) end
//            else if (p.constraintSelector == 1) begin `lpbkDaZeroTimeProv(i,1) `lpbkSaZeroTimeProv(i,1) `lpbkLaZeroTimeProv(i,1) end
//            else if (p.constraintSelector == 2) begin `lpbkDaZeroTimeProv(e,0) `lpbkSaZeroTimeProv(e,0) `lpbkLaZeroTimeProv(e,0) end
//            else if (p.constraintSelector == 3) begin `lpbkDaZeroTimeProv(e,1) `lpbkSaZeroTimeProv(e,1) `lpbkLaZeroTimeProv(e,1) end

   line 249-254
//            if      (p.constraintSelector == 0) begin `lpbkMatchIdZeroTimeProv(i,0) end
//            else if (p.constraintSelector == 1) begin `lpbkMatchIdZeroTimeProv(i,1) end
//            else if (p.constraintSelector == 2) begin `lpbkMatchIdZeroTimeProv(e,0) end
//            else if (p.constraintSelector == 3) begin `lpbkMatchIdZeroTimeProv(e,1) end


* regression test issues [100%]
** DONE tc_503 egress, ptp_editor calc TSG has bug.
   CLOSED: [2018-09-10 Mon 11:12]
   - State "DONE"       from "TODO"       [2018-09-10 Mon 11:12]
   need Tonny double check, just check the first 'UVM_ERROR' in the tc_503.log
** DONE tc_301a tc_301b sys side rate meter multiple set 10G.
   CLOSED: [2018-08-20 Mon 11:10]
   - State "DONE"       from "TODO"       [2018-08-20 Mon 11:10]
   tc_301b, all input the constant size packet.
   port1 to port9 8G, 
   port9 to port9 10G, it should come out 2G, but in fact is 2.15G, it not correct.

   Correct the `define CLOCK1X_FREQUENCY        177_777_778, the rate_meter_multiple method could prov the correct the value.